app/views/genres/show.html.erb


  <% if @genre.tracks.any? %>
---
SELECT  1 AS one FROM "tracks"  WHERE "tracks"."genre_id" = $1 LIMIT 1  [["genre_id", 1]]
SELECT "tracks".* FROM "tracks"  WHERE "tracks"."genre_id" = $1  [["genre_id", 1]]