app/views/tracks/_track_form.html.erb

  <%= f.label :genre_id, 'Genre' %><br>
  <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>
---
SELECT "genres".* FROM "genres"