app/views/users/show.html.erb


  <% if @user.tracks.any? %>
---
SELECT  1 AS one FROM "tracks"  WHERE "tracks"."user_id" = $1 LIMIT 1  [["user_id", 7]]
SELECT "tracks".* FROM "tracks"  WHERE "tracks"."user_id" = $1  [["user_id", 2]]