app/controllers/comments_controller.rb

  def index
    @track = Track.find(params[:track_id])
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]

  def create
    @track = Track.find(params[:track_id])
    @comment = @track.comments.new(comment_params)
    @comment.status = "draft"
    @comment.user = current_user
    @comment.save
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "gghjghkghhg"], ["commentable_id", 3], ["commentable_type", "Track"], ["created_at", "2014-12-17 12:01:37.611053"], ["updated_at", "2014-12-17 12:01:37.611053"], ["user_id", 2]]

  def approve
    Comment.where("id IN (?)", params[:comment_ids]).update_all(status: "approved")
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1  ORDER BY created_at ASC LIMIT 1  [["id", 10]]
UPDATE "comments" SET "status" = 'approved' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments"  WHERE (id IN ('10'))  ORDER BY created_at ASC)