app/controllers/genres_controller.rb

INSERT INTO "genres" ("name") VALUES ($1) RETURNING "id"  [["name", "Disco"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save

SELECT  "genres".* FROM "genres"  WHERE "genres"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "genres" WHERE "genres"."id" = $1  [["id", 4]]
---
  def destroy
    @genre = Genre.find(params[:id])
    @genre.destroy