app/controllers/tracks_controller.rb

    def create
      @track = current_user.tracks.new(track_params)
      @track.save
---
INSERT INTO "tracks" ("created_at", "details", "genre_id", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-12-16 17:37:17.342335"], ["details", "test nfsjaklnjksnkjdsgkjlng"], ["genre_id", 1], ["name", "test"], ["updated_at", "2014-12-16 17:37:17.342335"], ["user_id", 1]]

    def update
      @track = Track.find(params[:id])
      @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "tracks" SET "track_file" = $1, "updated_at" = $2 WHERE "tracks"."id" = 3  [["track_file", "06_Follow_Me.m4a"], ["updated_at", "2014-12-16 18:23:48.454956"]]