app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 6  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "bio" = $1, "updated_at" = $2, "user_image" = $3 WHERE "users"."id" = 6  [["bio", "Text about artist"], ["updated_at", "2014-12-18 15:06:09.874514"], ["user_image", "background.jpeg"]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)